wisteria-1c/Конфигурация/Reports/АнализБазыЛидов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>АнализБазыЛидов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтоОтчетУНФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/СвязиКонтрагентЛид.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СвязиКонтрагентЛид</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Лид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лиды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ВариантЗавершенияРаботыСЛидом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантЗавершенияРаботыСЛидом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПереведенВПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НекачественныйЛид</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ВидыЛидов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыЛидов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПервичноеОбращение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторноеОбращение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Reports/АнализБазыЛидов/Forms/Форма/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ДанныеВыбораПериодаИзВыпадающегоСписка;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Элементы.ГруппаПоМенеджерамПодробно.ОтображатьЗаголовок = Истина;
	КонецЕсли;
	
	ПолучитьЗначениеОтбораПоПериоду();
	
	ЗаполнитьСпискиВыбора();
	
	АдаптацияТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ЗначениеЗаполнено(ОтборПериодРасшифровка) Тогда
		ОтборПериодЗначение = ОтборПериодРасшифровка;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ОтборПериодЗначение) Тогда
		ОтборПериодЗначение.Вариант = ВариантСтандартногоПериода.Месяц;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПараметрПериодичность) Тогда
		ПараметрПериодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя");
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("СФормироватьПриОткрытии", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборВидНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ИнтерактивныйСписокВыбораВидаЛида;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОтборВид = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ИнтерактивныйСписокВыбораВидаЛида;
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбораСостояния = ПолучитьДанныеВыбора(Тип("СправочникСсылка.СостоянияЛидов"), ПараметрыПолученияДанных);
	ДанныеВыбора = ДанныеВыбораСостояния;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодДатаНачалаПриИзменении(Элемент)
	
	Если ОтборПериодЗначение.ДатаНачала <> '00010101' Тогда
		ОтборПериодЗначение.ДатаНачала = НачалоДня(ОтборПериодЗначение.ДатаНачала);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодДатаОкончанияПриИзменении(Элемент)
	
	Если ОтборПериодЗначение.ДатаОкончания <> '00010101' Тогда
		ОтборПериодЗначение.ДатаОкончания = КонецДня(ОтборПериодЗначение.ДатаОкончания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МенеджерыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Обработчик = Новый ОписаниеОповещения("МенеджерыЗавершениеВыбора", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючУникальности", КлючНазначенияИспользования);
	ПараметрыФормы.Вставить("Отмеченные", ОтборМенеджеры);
	ПараметрыФормы.Вставить("ЗначенияДляВыбора", ОтборМенеджерыВсе);
	ПараметрыФормы.Вставить("ВыводитьФлажок", Истина);
	ПараметрыФормы.Вставить("ОграничиватьВыборУказаннымиЗначениями", Ложь);
	ПараметрыФормы.Вставить("ОписаниеТипов", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ПараметрыФормы.Вставить("Представление", НСтр("ru = 'менеджеры'"));
	
	// Использование формы БСП 2.2.5
	ОткрытьФорму("ОбщаяФорма.ВводЗначенийСпискомСФлажками", ПараметрыФормы, ЭтотОбъект, , , , Обработчик,
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура МенеджерыОчистка(Элемент, СтандартнаяОбработка)
	
	ОтборМенеджерыВсе.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрПериодичностьПриИзменении(Элемент)
	
	ОбновитьДиаграммуНовыеПоПериодам();
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаНовыеОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВРег(Расшифровка) = ВРег("Новые") Тогда
		ПризнакРасшифровки = НСтр("ru = 'Новые'");
		ЗаголовокФормы = НСтр("ru = 'Новые лиды'");
	ИначеЕсли ВРег(Расшифровка) = ВРег("Существующие") Тогда
		ПризнакРасшифровки = НСтр("ru = 'Существующие'");
		ЗаголовокФормы = НСтр("ru = 'Существующие лиды'");
	КонецЕсли;
	
	КомпонентыПредставленияОтборов = Новый Массив;
	КомпонентыПредставленияОтборов.Добавить(СтрШаблон(НСтр("ru = '%1 лиды за период: с %2 по %3'"),
		ПризнакРасшифровки,
		Формат(ОтборПериодЗначение.ДатаНачала, "ДФ=dd.MM.yyyy"),
		Формат(ОтборПериодЗначение.ДатаОкончания, "ДФ=dd.MM.yyyy")));
		
	Если ЗначениеЗаполнено(ОтборТег) Тогда
		КомпонентыПредставленияОтборов.Добавить(СтрШаблон(НСтр("ru = 'с тегом: %1'"), ОтборТег));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборМенеджеры) Тогда
		КомпонентыПредставленияОтборов.Добавить(СтрШаблон(НСтр("ru = 'по менеджерам: %1'"), ОтборМенеджеры));
	КонецЕсли;
	
	ПредставлениеОтборов = СтрСоединить(КомпонентыПредставленияОтборов, ", ");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаголовокФормы", ЗаголовокФормы);
	ПараметрыФормы.Вставить("ПредставлениеОтборов", ПредставлениеОтборов);
	ПараметрыФормы.Вставить("АдресТабличногоДокумента", СформироватьРасшифровкуНовых(Расшифровка));
	
	ОткрытьФорму("ОбщаяФорма.ДополнительнаяРасшифровка", ПараметрыФормы, ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаНовыеПоПериодамОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВРег(ПараметрПериодичность) = ВРег("День") Тогда
		ПредставлениеПериода = Формат(Расшифровка, "ДФ=dd.MM.yyyy");
	ИначеЕсли ВРег(ПараметрПериодичность) = ВРег("Неделя") Тогда
		ПредставлениеПериода = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'неделю с %1 по %2'"),
			Формат(Расшифровка, "ДФ=dd.MM.yyyy"),
			Формат(КонецНедели(Расшифровка), "ДФ=dd.MM.yyyy"));
	ИначеЕсли ВРег(ПараметрПериодичность) = ВРег("Месяц") Тогда
		ПредставлениеПериода = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'месяц с %1 по %2'"),
			Формат(Расшифровка, "ДФ=dd.MM.yyyy"),
			Формат(КонецМесяца(Расшифровка), "ДФ=dd.MM.yyyy"));
	КонецЕсли;
	
	КомпонентыПредставленияОтборов = Новый Массив;
	КомпонентыПредставленияОтборов.Добавить(СтрШаблон(НСтр("ru = 'Новые лиды за период: %1'"), ПредставлениеПериода));
	
	Если ЗначениеЗаполнено(ОтборТег) Тогда
		КомпонентыПредставленияОтборов.Добавить(СтрШаблон(НСтр("ru = 'с тегом: %1'"), ОтборТег));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборМенеджеры) Тогда
		КомпонентыПредставленияОтборов.Добавить(СтрШаблон(НСтр("ru = 'по менеджерам: %1'"), ОтборМенеджеры));
	КонецЕсли;
	
	ПредставлениеОтборов = СтрСоединить(КомпонентыПредставленияОтборов, ", ");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаголовокФормы", НСтр("ru = 'Новые лиды за период'"));
	ПараметрыФормы.Вставить("ПредставлениеОтборов", ПредставлениеОтборов);
	ПараметрыФормы.Вставить("АдресТабличногоДокумента", СформироватьРасшифровкуНовыхЗаПериод(Расшифровка));
	
	ОткрытьФорму("ОбщаяФорма.ДополнительнаяРасшифровка", ПараметрыФормы, ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаПоМенеджерамОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КомпонентыПредставленияОтборов = Новый Массив;
	КомпонентыПредставленияОтборов.Добавить(
		СтрШаблон(НСтр("ru = 'Лиды менеджера: %1'"),
		?(ТипЗнч(Расшифровка) = Тип("Массив"), НСтр("ru = '<сводно>'"), Расшифровка)));
	
	Если ЗначениеЗаполнено(ОтборТег) Тогда
		КомпонентыПредставленияОтборов.Добавить(СтрШаблон(НСтр("ru = 'с тегом: %1'"), ОтборТег));
	КонецЕсли;
	
	ПредставлениеОтборов = СтрСоединить(КомпонентыПредставленияОтборов, ", ");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаголовокФормы", НСтр("ru = 'Лиды по менеджерам'"));
	ПараметрыФормы.Вставить("ПредставлениеОтборов", ПредставлениеОтборов);
	ПараметрыФормы.Вставить("АдресТабличногоДокумента", СформироватьРасшифровкуПоМенеджерам(Расшифровка));
	
	ОткрытьФорму("ОбщаяФорма.ДополнительнаяРасшифровка", ПараметрыФормы, ЭтотОбъект, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ИзменитьПериод(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = ОтборПериодЗначение;
	
	ВыбранныйПериод = Ждать Диалог.РедактироватьАсинх();
	Если ВыбранныйПериод <> Неопределено Тогда
		ОтборПериодЗначение = ВыбранныйПериод;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция МаксимумСерийНеЗадано()
	
	//@skip-check bsl-legacy-check-dynamic-feature-access
	Возврат МаксимумСерий.НеЗадано;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидПодписейКДиаграммеСерияЗначение()
	
	//@skip-check bsl-legacy-check-dynamic-feature-access
	Возврат ВидПодписейКДиаграмме.Значение;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидПодписейКДиаграммеЗначение()
	
	//@skip-check bsl-legacy-check-dynamic-feature-access
	Возврат ВидПодписейКДиаграмме.Значение;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидПодписейКДиаграммеПроцент()
	
	//@skip-check bsl-legacy-check-dynamic-feature-access
	Возврат ВидПодписейКДиаграмме.Процент;
	
КонецФункции

&НаСервере
Процедура СформироватьОтчет()
	
	ОбновитьДиаграммуНовые();
	ОбновитьДиаграммуНовыеПоПериодам();
	ОбновитьДиаграммуПоМенеджерам();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуНовые()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(Лиды.Ссылка) КАК КоличествоВсего,
		|	СУММА(ВЫБОР
		|			КОГДА Лиды.ДатаСоздания МЕЖДУ &НовыеНачало И &НовыеКонец
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоНовых
		|ИЗ
		|	Справочник.Лиды КАК Лиды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
		|		ПО Лиды.Ссылка = СвязиКонтрагентЛид.Лид
		|ГДЕ
		|	Лиды.ПометкаУдаления = ЛОЖЬ
		|	И Лиды.ЭтоГруппа = ЛОЖЬ";
		
	Если ЗначениеЗаполнено(ОтборТег) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И Лиды.Теги.Тег = &ОтборТег";
		Запрос.УстановитьПараметр("ОтборТег", ОтборТег);
	КонецЕсли;
	
	
	Если ОтборМенеджеры.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И Лиды.Ответственный В (&ОтборМенеджеры)";
		Запрос.УстановитьПараметр("ОтборМенеджеры", ОтборМенеджеры);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборИсточникПривлеченияПокупателей) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И Лиды.ИсточникПривлечения = &ОтборИсточник";
		Запрос.УстановитьПараметр("ОтборИсточник", ОтборИсточникПривлеченияПокупателей);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборСостояние) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И Лиды.СостояниеЛида = &ОтборСостояние";
		Запрос.УстановитьПараметр("ОтборСостояние", ОтборСостояние);
	КонецЕсли;
	
	РезультатЛида = РезультатЛидаПоОтбору();
	Если РезультатЛида <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И Лиды.ВариантЗавершения = &ОтборРезультат";
		Запрос.УстановитьПараметр("ОтборРезультат", РезультатЛида);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборПокупатель) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И СвязиКонтрагентЛид.Контрагент = &ОтборПокупатель";
		Запрос.УстановитьПараметр("ОтборПокупатель", ОтборПокупатель);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
		|		ПО Лиды.Ссылка = СвязиКонтрагентЛид.Лид", "");
	КонецЕсли;
	
	ВидЛида = ВидЛидаПоОтбору();
	Если ЗначениеЗаполнено(ВидЛида) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И Лиды.Вид = &ОтборВид";
		Запрос.УстановитьПараметр("ОтборВид", ВидЛида);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НовыеНачало", ОтборПериодЗначение.ДатаНачала);
	Запрос.УстановитьПараметр("НовыеКонец", ОтборПериодЗначение.ДатаОкончания);
	
	ВыборкаОбщийИтог = Запрос.Выполнить().Выбрать();
	Если ВыборкаОбщийИтог.Следующий() Тогда
		Новых = ?(ВыборкаОбщийИтог.КоличествоНовых = Null, 0, ВыборкаОбщийИтог.КоличествоНовых);
		Существующих = ?(ВыборкаОбщийИтог.КоличествоВсего = Null, 0, ВыборкаОбщийИтог.КоличествоВсего - Новых);
	Иначе
		Новых = 0;
		Существующих = 0;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборПериодЗначение.ДатаНачала) И ЗначениеЗаполнено(ОтборПериодЗначение.ДатаОкончания) Тогда
		Элементы.ДиаграммаНовые.Заголовок = НСтр("ru = 'Новых за'") +Символы.НПП + Формат(ОтборПериодЗначение.ДатаНачала, "ДФ=dd.MM.yy") + " - " + Формат(ОтборПериодЗначение.ДатаОкончания, "ДФ=dd.MM.yy");
	Иначе
		Элементы.ДиаграммаНовые.Заголовок = НСтр("ru = 'Новых за (период не указан)'");
	КонецЕсли;
	
	ДиаграммаНовые.Обновление = Ложь;
	ДиаграммаНовые.Очистить();
	ДиаграммаНовые.АвтоТранспонирование = Ложь;
	ДиаграммаНовые.МаксимумСерий = МаксимумСерийНеЗадано();
	ДиаграммаНовые.ВидПодписей = ВидПодписейКДиаграммеСерияЗначение();
	ДиаграммаНовые.РазделительПодписей = ": ";
	//@skip-check new-font
	ДиаграммаНовые.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, -1);
	
	Точка = ДиаграммаНовые.Точки.Добавить("Количество");
	Точка.Текст = "Количество";
	Точка.ПриоритетЦвета = Ложь;
	
	СерияНовые = ДиаграммаНовые.Серии.Добавить(СтрШаблон(НСтр("ru = 'Новые (%1)'"), Новых));
	СерияНовые.Цвет = ЦветаПалитры.ПервыйБрендовый;
	Подсказка = НСтр("ru = 'Создано новых лидов за период:'") + Символы.НПП + Новых;
	ДиаграммаНовые.УстановитьЗначение(Точка, СерияНовые, Новых, "Новые", Подсказка);
	
	СерияСуществующие = ДиаграммаНовые.Серии.Добавить(СтрШаблон(НСтр("ru = 'Существующие (%1)'"), Существующих));
	СерияСуществующие.Цвет = ЦветаПалитры.ВторойБрендовый;
	Подсказка = НСтр("ru = 'Существующих лидов:'") + Символы.НПП + Существующих;
	ДиаграммаНовые.УстановитьЗначение(Точка, СерияСуществующие, Существующих, "Существующие", Подсказка);
	
	ДиаграммаНовые.АвтоТранспонирование = Истина;
	ДиаграммаНовые.Обновление = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуНовыеПоПериодам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(Лиды.ДатаСоздания, НЕДЕЛЯ) КАК ДатаСоздания,
		|	Лиды.Ссылка КАК Новый
		|ИЗ
		|	Справочник.Лиды КАК Лиды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
		|		ПО Лиды.Ссылка = СвязиКонтрагентЛид.Лид
		|ГДЕ
		|	Лиды.ПометкаУдаления = ЛОЖЬ
		|	И Лиды.ЭтоГруппа = ЛОЖЬ
		|	И Лиды.ДатаСоздания МЕЖДУ &НовыеНачало И &НовыеКонец
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСоздания
		|ИТОГИ
		|	КОЛИЧЕСТВО(Новый)
		|ПО
		|	ДатаСоздания ПЕРИОДАМИ(НЕДЕЛЯ, &НовыеНачало, &НовыеКонец)";
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "НЕДЕЛЯ", ВРег(Строка(ПараметрПериодичность)));
	
	Если Не ЗначениеЗаполнено(ОтборПокупатель) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
		|		ПО Лиды.Ссылка = СвязиКонтрагентЛид.Лид", "");
	КонецЕсли;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
	
	Если ЗначениеЗаполнено(ОтборТег) Тогда
		ОтборЗапроса.Добавить("Лиды.Теги.Тег = &ОтборТег");
		Запрос.УстановитьПараметр("ОтборТег", ОтборТег);
	КонецЕсли;
	
	
	Если ОтборМенеджеры.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.Ответственный В (&ОтборМенеджеры)");
		Запрос.УстановитьПараметр("ОтборМенеджеры", ОтборМенеджеры);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборИсточникПривлеченияПокупателей) Тогда
		ОтборЗапроса.Добавить("Лиды.ИсточникПривлечения = &ОтборИсточник");
		Запрос.УстановитьПараметр("ОтборИсточник", ОтборИсточникПривлеченияПокупателей);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборСостояние) Тогда
		ОтборЗапроса.Добавить("Лиды.СостояниеЛида = &ОтборСостояние");
		Запрос.УстановитьПараметр("ОтборСостояние", ОтборСостояние);
	КонецЕсли;
	
	РезультатЛида = РезультатЛидаПоОтбору();
	Если РезультатЛида <> Неопределено Тогда
		ОтборЗапроса.Добавить("Лиды.ВариантЗавершения = &ОтборРезультат");
		Запрос.УстановитьПараметр("ОтборРезультат", РезультатЛида);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборПокупатель) Тогда
		ОтборЗапроса.Добавить("СвязиКонтрагентЛид.Контрагент = &ОтборПокупатель");
		Запрос.УстановитьПараметр("ОтборПокупатель", ОтборПокупатель);
	КонецЕсли;
	
	ВидЛида = ВидЛидаПоОтбору();
	Если ЗначениеЗаполнено(ВидЛида) Тогда
		ОтборЗапроса.Добавить("Лиды.Вид = &ОтборВид");
		Запрос.УстановитьПараметр("ОтборВид", ВидЛида);
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Запрос.УстановитьПараметр("НовыеНачало", ОтборПериодЗначение.ДатаНачала);
	Запрос.УстановитьПараметр("НовыеКонец", ОтборПериодЗначение.ДатаОкончания);
	
	ВыборкаДатаСоздания = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ДатаСоздания", "Все");
	
	ДиаграммаНовыеПоПериодам.Обновление = Ложь;
	ДиаграммаНовыеПоПериодам.Очистить();
	ДиаграммаНовыеПоПериодам.АвтоТранспонирование = Ложь;
	ДиаграммаНовыеПоПериодам.МаксимумСерий = МаксимумСерийНеЗадано();
	ДиаграммаНовыеПоПериодам.ВидПодписей = ВидПодписейКДиаграммеЗначение();
	//@skip-check new-font
	ДиаграммаНовыеПоПериодам.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, -1);
	ДиаграммаНовыеПоПериодам.ФорматЗначенийВПодписях = "ЧДЦ=; ЧН=' '";
	ДиаграммаНовыеПоПериодам.АвтоУстановкаТекстаТочек = Ложь;
	ДиаграммаНовыеПоПериодам.ОбластьПостроения.ОтображатьПодписиШкалыТочек = Истина;
	//@skip-check new-font
	
	Серия = ДиаграммаНовыеПоПериодам.Серии.Добавить("Новые");
	Серия.Линия = Новый Линия(ТипЛинииДиаграммы.Сплошная, 2);
	//@skip-check bsl-legacy-check-dynamic-feature-access
	Серия.Маркер = ТипМаркераДиаграммы.Круг;
	Серия.ПриоритетЦвета = Истина;
	Серия.Цвет = ЦветаПалитры.ВторойБрендовый;
	
	Пока ВыборкаДатаСоздания.Следующий() Цикл
		Текст = Формат(ВыборкаДатаСоздания.ДатаСоздания, "ДФ=dd.MM.yy");
		Точка = ДиаграммаНовыеПоПериодам.Точки.Добавить(Текст);
		Подсказка = НСтр("ru = 'Создано'") + Символы.НПП + ВыборкаДатаСоздания.Новый + Символы.НПП + НСтр("ru = 'лидов'") + Символы.НПП + Текст;
		ДиаграммаНовыеПоПериодам.УстановитьЗначение(Точка, Серия, ?(ВыборкаДатаСоздания.Новый = Null, 0, ВыборкаДатаСоздания.Новый), ВыборкаДатаСоздания.ДатаСоздания, Подсказка);
	КонецЦикла;
	
	ДиаграммаНовыеПоПериодам.АвтоТранспонирование = Истина;
	ДиаграммаНовыеПоПериодам.Обновление = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграммуПоМенеджерам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(Лиды.Ссылка) КАК Лиды,
		|	Лиды.Ответственный КАК Ответственный,
		|	Лиды.Ответственный.Представление КАК ОтветственныйПредставление
		|ИЗ
		|	Справочник.Лиды КАК Лиды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
		|		ПО Лиды.Ссылка = СвязиКонтрагентЛид.Лид
		|ГДЕ
		|	Лиды.ПометкаУдаления = ЛОЖЬ
		|	И Лиды.ЭтоГруппа = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	Лиды.Ответственный,
		|	Лиды.Ответственный.Представление
		|
		|УПОРЯДОЧИТЬ ПО
		|	Лиды УБЫВ,
		|	Лиды.Ответственный.Наименование";
	
	Если Не ЗначениеЗаполнено(ОтборПокупатель) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
		|		ПО Лиды.Ссылка = СвязиКонтрагентЛид.Лид", "");
	КонецЕсли;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
	
	Если ЗначениеЗаполнено(ОтборТег) Тогда
		ОтборЗапроса.Добавить("Лиды.Теги.Тег = &ОтборТег");
		Запрос.УстановитьПараметр("ОтборТег", ОтборТег);
	КонецЕсли;
	
	
	Если ОтборМенеджеры.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.Ответственный В (&ОтборМенеджеры)");
		Запрос.УстановитьПараметр("ОтборМенеджеры", ОтборМенеджеры);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборИсточникПривлеченияПокупателей) Тогда
		ОтборЗапроса.Добавить("Лиды.ИсточникПривлечения = &ОтборИсточник");
		Запрос.УстановитьПараметр("ОтборИсточник", ОтборИсточникПривлеченияПокупателей);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборСостояние) Тогда
		ОтборЗапроса.Добавить("Лиды.СостояниеЛида = &ОтборСостояние");
		Запрос.УстановитьПараметр("ОтборСостояние", ОтборСостояние);
	КонецЕсли;
	
	РезультатЛида = РезультатЛидаПоОтбору();
	Если РезультатЛида <> Неопределено Тогда
		ОтборЗапроса.Добавить("Лиды.ВариантЗавершения = &ОтборРезультат");
		Запрос.УстановитьПараметр("ОтборРезультат", РезультатЛида);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборПокупатель) Тогда
		ОтборЗапроса.Добавить("СвязиКонтрагентЛид.Контрагент = &ОтборПокупатель");
		Запрос.УстановитьПараметр("ОтборПокупатель", ОтборПокупатель);
	КонецЕсли;
	
	ВидЛида = ВидЛидаПоОтбору();
	Если ЗначениеЗаполнено(ВидЛида) Тогда
		ОтборЗапроса.Добавить("Лиды.Вид = &ОтборВид");
		Запрос.УстановитьПараметр("ОтборВид", ВидЛида);
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	ВыборкаОтветственные = Запрос.Выполнить().Выбрать();
	
	// Для диаграммы используем свой механизм сводной серии, иначе не вывести произвольную легенду
	
	ДиаграммаПоМенеджерам.Обновление = Ложь;
	ДиаграммаПоМенеджерам.Очистить();
	ДиаграммаПоМенеджерам.АвтоТранспонирование = Ложь;
	ДиаграммаПоМенеджерам.МаксимумСерий = МаксимумСерийНеЗадано();
	ДиаграммаПоМенеджерам.ВидПодписей = ВидПодписейКДиаграммеПроцент();
	ДиаграммаПоМенеджерам.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки, -1);
	ДиаграммаПоМенеджерам.ФорматПроцентовВПодписях = "ЧДЦ=";
	
	Точка = ДиаграммаПоМенеджерам.Точки.Добавить("Количество");
	Точка.Текст = "Количество";
	Точка.ПриоритетЦвета = Ложь;
	
	СтрокиОстальные = Новый Массив;
	ПорядковыйНомерСерии = 0;
	МаксимумСерийДиаграммы = 6;
	
	Пока ВыборкаОтветственные.Следующий() Цикл
		
		Если ПорядковыйНомерСерии < МаксимумСерийДиаграммы Тогда
			
			ПредставлениеМенеджера = ?(ЗначениеЗаполнено(ВыборкаОтветственные.Ответственный),
				ВыборкаОтветственные.ОтветственныйПредставление, НСтр("ru = '<Менеджер не указан>'"));
			Серия = ДиаграммаПоМенеджерам.Серии.Добавить(СтрШаблон("%1 (%2)", ПредставлениеМенеджера,
				ВыборкаОтветственные.Лиды));
			Серия.Цвет = ЦветСерииДиаграммыЛидовПоМенеджерам(ПорядковыйНомерСерии);
			Подсказка = СтрШаблон(НСтр("ru = '%1, лидов:%2%3'"), ПредставлениеМенеджера, Символы.НПП,
				ВыборкаОтветственные.Лиды);
			ДиаграммаПоМенеджерам.УстановитьЗначение(Точка, Серия, ВыборкаОтветственные.Лиды,
				ВыборкаОтветственные.Ответственный, Подсказка);
			
		Иначе
			
			ПредставлениеМенеджера = НСтр("ru = '<Остальные>'");
			
			Серия = ДиаграммаПоМенеджерам.Серии.Получить(ДиаграммаПоМенеджерам.Серии.Количество() - 1);
			Серия.Текст = СтрШаблон("%1 (%2)", ПредставлениеМенеджера, ВыборкаОтветственные.Лиды);
			Серия.Цвет = ЦветСерииДиаграммыЛидовПоМенеджерам(ПорядковыйНомерСерии);
			
			СводноеЗначение = ДиаграммаПоМенеджерам.ПолучитьЗначение(Точка, Серия);
			
			Подсказка = СтрШаблон(НСтр("ru = '%1, лидов:%2%3'"), ПредставлениеМенеджера, Символы.НПП,
				СводноеЗначение.Значение + ВыборкаОтветственные.Лиды);
			
			Расшифровка = СводноеЗначение.Расшифровка;
			Если ТипЗнч(Расшифровка) = Тип("Массив") Тогда
				Расшифровка.Добавить(ВыборкаОтветственные.Ответственный);
			Иначе
				Расшифровка = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Расшифровка);
				Расшифровка.Добавить(ВыборкаОтветственные.Ответственный);
			КонецЕсли;
			
			ДиаграммаПоМенеджерам.УстановитьЗначение(Точка, Серия, СводноеЗначение.Значение
				+ ВыборкаОтветственные.Лиды, Расшифровка, Подсказка);
			
			ТекстПодробно = ?(ЗначениеЗаполнено(ВыборкаОтветственные.Ответственный),
				ВыборкаОтветственные.ОтветственныйПредставление, НСтр("ru = '<Менеджер не указан>'")) + " – "
				+ ВыборкаОтветственные.Лиды;
			СтрокаОстальные = Новый ФорматированнаяСтрока(ТекстПодробно, Символы.ПС);
			СтрокиОстальные.Добавить(СтрокаОстальные);
			
		КонецЕсли;
		
		ПорядковыйНомерСерии = ПорядковыйНомерСерии + 1;
		
	КонецЦикла;
	
	ДиаграммаПоМенеджерам.АвтоТранспонирование = Истина;
	ДиаграммаПоМенеджерам.Обновление = Истина;
	
	Если СтрокиОстальные.Количество() Тогда
		Элементы.МенеджерыОстальныеОтображение.Видимость = Истина;
		МенеджерыОстальныеОтображение = Новый ФорматированнаяСтрока(СтрокиОстальные);
	Иначе
		Элементы.МенеджерыОстальныеОтображение.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЦветСерииДиаграммыЛидовПоМенеджерам(ИндексСерии)
	
	Если ИндексСерии = 0 Тогда
		Возврат ЦветаПалитры.Голубой;
	ИначеЕсли ИндексСерии = 1 Тогда
		Возврат ЦветаПалитры.Желтый;
	ИначеЕсли ИндексСерии = 2 Тогда
		Возврат ЦветаПалитры.Зеленый;
	ИначеЕсли ИндексСерии = 3 Тогда
		Возврат ЦветаПалитры.Красный;
	ИначеЕсли ИндексСерии = 4 Тогда
		Возврат ЦветаПалитры.Сиреневый;
	Иначе
		Возврат ЦветаПалитры.Фиолетовый;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СформироватьРасшифровкуНовых(Признак)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_НовыеКонтрагенты";
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НовыеКонтрагенты";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	СтруктураОбластей = Новый Структура;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.АнализБазыЛидов.ПФ_MXL_КонтрагентыРасшифровка");
	
	СтруктураОбластей.Вставить("Шапка",	 Макет.ПолучитьОбласть("Шапка"));
	СтруктураОбластей.Вставить("Строка", Макет.ПолучитьОбласть("Строка"));
	СтруктураОбластей.Вставить("Итог",	 Макет.ПолучитьОбласть("Итог"));
	СтруктураОбластей.Вставить("Отступ", Макет.ПолучитьОбласть("Отступ"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Лиды.Ссылка КАК Лид,
		|	ВЫБОР
		|		КОГДА Лиды.ДатаСоздания МЕЖДУ &НовыеНачало И &НовыеКонец
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Новый,
		|	Лиды.Ответственный КАК Менеджер,
		|	Лиды.ДатаСоздания КАК Создан,
		|	Лиды.СостояниеЛида КАК СостояниеЛида,
		|	Лиды.ВариантЗавершения КАК Результат,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.Ссылка) КАК ПредставлениеЛида,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.Ответственный) КАК ПредставлениеМенеджера
		|ИЗ
		|	Справочник.Лиды КАК Лиды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
		|		ПО Лиды.Ссылка = СвязиКонтрагентЛид.Лид
		|ГДЕ
		|	Лиды.ПометкаУдаления = ЛОЖЬ
		|	И Лиды.ЭтоГруппа = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Создан УБЫВ,
		|	Лиды.Наименование";
	
	Если Не ЗначениеЗаполнено(ОтборПокупатель) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
		|		ПО Лиды.Ссылка = СвязиКонтрагентЛид.Лид", "");
	КонецЕсли;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
	
	Если ВРег(Признак) = ВРег("Новые") Тогда
		ОтборЗапроса.Добавить("Лиды.ДатаСоздания МЕЖДУ &НовыеНачало И &НовыеКонец");
	ИначеЕсли ВРег(Признак) = ВРег("Существующие") Тогда
		ОтборЗапроса.Добавить("НЕ (Лиды.ДатаСоздания МЕЖДУ &НовыеНачало И &НовыеКонец)");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборТег) Тогда
		ОтборЗапроса.Добавить("Лиды.Теги.Тег = &ОтборТег");
		Запрос.УстановитьПараметр("ОтборТег", ОтборТег);
	КонецЕсли;
	
	
	Если ОтборМенеджеры.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.Ответственный В (&ОтборМенеджеры)");
		Запрос.УстановитьПараметр("ОтборМенеджеры", ОтборМенеджеры);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборИсточникПривлеченияПокупателей) Тогда
		ОтборЗапроса.Добавить("Лиды.ИсточникПривлечения = &ОтборИсточник");
		Запрос.УстановитьПараметр("ОтборИсточник", ОтборИсточникПривлеченияПокупателей);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборСостояние) Тогда
		ОтборЗапроса.Добавить("Лиды.СостояниеЛида = &ОтборСостояние");
		Запрос.УстановитьПараметр("ОтборСостояние", ОтборСостояние);
	КонецЕсли;
	
	РезультатЛида = РезультатЛидаПоОтбору();
	Если РезультатЛида <> Неопределено Тогда
		ОтборЗапроса.Добавить("Лиды.ВариантЗавершения = &ОтборРезультат");
		Запрос.УстановитьПараметр("ОтборРезультат", РезультатЛида);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборПокупатель) Тогда
		ОтборЗапроса.Добавить("СвязиКонтрагентЛид.Контрагент = &ОтборПокупатель");
		Запрос.УстановитьПараметр("ОтборПокупатель", ОтборПокупатель);
	КонецЕсли;
	
	ВидЛида = ВидЛидаПоОтбору();
	Если ЗначениеЗаполнено(ВидЛида) Тогда
		ОтборЗапроса.Добавить("Лиды.Вид = &ОтборВид");
		Запрос.УстановитьПараметр("ОтборВид", ВидЛида);
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Запрос.УстановитьПараметр("НовыеНачало", ОтборПериодЗначение.ДатаНачала);
	Запрос.УстановитьПараметр("НовыеКонец", ОтборПериодЗначение.ДатаОкончания);
	
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	ТабличныйДокумент.Вывести(СтруктураОбластей.Шапка);
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	
	НовыйИтог = 0;

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураОбластей.Строка.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(СтруктураОбластей.Строка);
		
		НовыйИтог = НовыйИтог + Число(Выборка.Новый);
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	
	СтруктураОбластей.Итог.Параметры.НовыйИтог = НовыйИтог;
	ТабличныйДокумент.Вывести(СтруктураОбластей.Итог);
	
	Возврат ПоместитьВоВременноеХранилище(ТабличныйДокумент, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция СформироватьРасшифровкуНовыхЗаПериод(ДатаРасшифровки)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_НовыеКонтрагентыЗаПериод";
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НовыеКонтрагентыЗаПериод";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	СтруктураОбластей = Новый Структура;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.АнализБазыЛидов.ПФ_MXL_КонтрагентыРасшифровка");
	
	СтруктураОбластей.Вставить("Шапка",	 Макет.ПолучитьОбласть("Шапка"));
	СтруктураОбластей.Вставить("Строка", Макет.ПолучитьОбласть("Строка"));
	СтруктураОбластей.Вставить("Итог",	 Макет.ПолучитьОбласть("Итог"));
	СтруктураОбластей.Вставить("Отступ", Макет.ПолучитьОбласть("Отступ"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Лиды.Ссылка КАК Лид,
		|	ИСТИНА КАК Новый,
		|	Лиды.Ответственный КАК Менеджер,
		|	Лиды.ДатаСоздания КАК Создан,
		|	Лиды.СостояниеЛида КАК СостояниеЛида,
		|	Лиды.ВариантЗавершения КАК Результат,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.Ссылка) КАК ПредставлениеЛида,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.Ответственный) КАК ПредставлениеМенеджера
		|ИЗ
		|	Справочник.Лиды КАК Лиды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
		|		ПО Лиды.Ссылка = СвязиКонтрагентЛид.Лид
		|ГДЕ
		|	Лиды.ПометкаУдаления = ЛОЖЬ
		|	И Лиды.ЭтоГруппа = ЛОЖЬ
		|	И НАЧАЛОПЕРИОДА(Лиды.ДатаСоздания, НЕДЕЛЯ) = &ДатаРасшифровки
		|	И Лиды.ДатаСоздания МЕЖДУ &НовыеНачало И &НовыеКонец
		|
		|УПОРЯДОЧИТЬ ПО
		|	Создан УБЫВ,
		|	Лиды.Наименование";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "НЕДЕЛЯ", ВРег(Строка(ПараметрПериодичность)));
	
	Если Не ЗначениеЗаполнено(ОтборПокупатель) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
		|		ПО Лиды.Ссылка = СвязиКонтрагентЛид.Лид", "");
	КонецЕсли;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
	
	Если ЗначениеЗаполнено(ОтборТег) Тогда
		ОтборЗапроса.Добавить("Лиды.Теги.Тег = &ОтборТег");
		Запрос.УстановитьПараметр("ОтборТег", ОтборТег);
	КонецЕсли;
	
	
	Если ОтборМенеджеры.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.Ответственный В (&ОтборМенеджеры)");
		Запрос.УстановитьПараметр("ОтборМенеджеры", ОтборМенеджеры);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборИсточникПривлеченияПокупателей) Тогда
		ОтборЗапроса.Добавить("Лиды.ИсточникПривлечения = &ОтборИсточник");
		Запрос.УстановитьПараметр("ОтборИсточник", ОтборИсточникПривлеченияПокупателей);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборСостояние) Тогда
		ОтборЗапроса.Добавить("Лиды.СостояниеЛида = &ОтборСостояние");
		Запрос.УстановитьПараметр("ОтборСостояние", ОтборСостояние);
	КонецЕсли;
	
	РезультатЛида = РезультатЛидаПоОтбору();
	Если РезультатЛида <> Неопределено Тогда
		ОтборЗапроса.Добавить("Лиды.ВариантЗавершения = &ОтборРезультат");
		Запрос.УстановитьПараметр("ОтборРезультат", РезультатЛида);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборПокупатель) Тогда
		ОтборЗапроса.Добавить("СвязиКонтрагентЛид.Контрагент = &ОтборПокупатель");
		Запрос.УстановитьПараметр("ОтборПокупатель", ОтборПокупатель);
	КонецЕсли;
	
	ВидЛида = ВидЛидаПоОтбору();
	Если ЗначениеЗаполнено(ВидЛида) Тогда
		ОтборЗапроса.Добавить("Лиды.Вид = &ОтборВид");
		Запрос.УстановитьПараметр("ОтборВид", ВидЛида);
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Запрос.УстановитьПараметр("НовыеНачало", ОтборПериодЗначение.ДатаНачала);
	Запрос.УстановитьПараметр("НовыеКонец", ОтборПериодЗначение.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаРасшифровки", ДатаРасшифровки);
	
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	ТабличныйДокумент.Вывести(СтруктураОбластей.Шапка);
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	
	НовыйИтог = 0;

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураОбластей.Строка.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(СтруктураОбластей.Строка);
		
		НовыйИтог = НовыйИтог + Число(Выборка.Новый);
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	
	СтруктураОбластей.Итог.Параметры.НовыйИтог = НовыйИтог;
	ТабличныйДокумент.Вывести(СтруктураОбластей.Итог);
	
	Возврат ПоместитьВоВременноеХранилище(ТабличныйДокумент, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция СформироватьРасшифровкуПоМенеджерам(Менеджеры)
	
	Если ТипЗнч(Менеджеры) <> Тип("Массив") Тогда
		Менеджеры = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Менеджеры);
	КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_КонтрагентыПоМенеджерам";
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КонтрагентыПоМенеджерам";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	СтруктураОбластей = Новый Структура;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.АнализБазыЛидов.ПФ_MXL_КонтрагентыРасшифровка");
	
	СтруктураОбластей.Вставить("Шапка",	 Макет.ПолучитьОбласть("Шапка"));
	СтруктураОбластей.Вставить("Строка", Макет.ПолучитьОбласть("Строка"));
	СтруктураОбластей.Вставить("Итог",	 Макет.ПолучитьОбласть("Итог"));
	СтруктураОбластей.Вставить("Отступ", Макет.ПолучитьОбласть("Отступ"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Лиды.Ссылка КАК Лид,
		|	ВЫБОР
		|		КОГДА Лиды.ДатаСоздания МЕЖДУ &НовыеНачало И &НовыеКонец
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Новый,
		|	Лиды.Ответственный КАК Менеджер,
		|	Лиды.ДатаСоздания КАК Создан,
		|	Лиды.СостояниеЛида КАК СостояниеЛида,
		|	Лиды.ВариантЗавершения КАК Результат,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.Ссылка) КАК ПредставлениеЛида,
		|	ПРЕДСТАВЛЕНИЕ(Лиды.Ответственный) КАК ПредставлениеМенеджера
		|ИЗ
		|	Справочник.Лиды КАК Лиды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
		|		ПО Лиды.Ссылка = СвязиКонтрагентЛид.Лид
		|ГДЕ
		|	Лиды.ПометкаУдаления = ЛОЖЬ
		|	И Лиды.ЭтоГруппа = ЛОЖЬ
		|	И Лиды.Ответственный В(&Менеджеры)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Создан УБЫВ,
		|	Лиды.Наименование";
	
	Если Не ЗначениеЗаполнено(ОтборПокупатель) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязиКонтрагентЛид КАК СвязиКонтрагентЛид
		|		ПО Лиды.Ссылка = СвязиКонтрагентЛид.Лид", "");
	КонецЕсли;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
	
	Если ЗначениеЗаполнено(ОтборТег) Тогда
		ОтборЗапроса.Добавить("Лиды.Теги.Тег = &ОтборТег");
		Запрос.УстановитьПараметр("ОтборТег", ОтборТег);
	КонецЕсли;
		
	Если ОтборМенеджеры.Количество() > 0 Тогда
		ОтборЗапроса.Добавить("Лиды.Ответственный В (&ОтборМенеджеры)");
		Запрос.УстановитьПараметр("ОтборМенеджеры", ОтборМенеджеры);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборИсточникПривлеченияПокупателей) Тогда
		ОтборЗапроса.Добавить("Лиды.ИсточникПривлечения = &ОтборИсточник");
		Запрос.УстановитьПараметр("ОтборИсточник", ОтборИсточникПривлеченияПокупателей);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборСостояние) Тогда
		ОтборЗапроса.Добавить("Лиды.СостояниеЛида = &ОтборСостояние");
		Запрос.УстановитьПараметр("ОтборСостояние", ОтборСостояние);
	КонецЕсли;
	
	РезультатЛида = РезультатЛидаПоОтбору();
	Если РезультатЛида <> Неопределено Тогда
		ОтборЗапроса.Добавить("Лиды.ВариантЗавершения = &ОтборРезультат");
		Запрос.УстановитьПараметр("ОтборРезультат", РезультатЛида);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборПокупатель) Тогда
		ОтборЗапроса.Добавить("СвязиКонтрагентЛид.Контрагент = &ОтборПокупатель");
		Запрос.УстановитьПараметр("ОтборПокупатель", ОтборПокупатель);
	КонецЕсли;
	
	ВидЛида = ВидЛидаПоОтбору();
	Если ЗначениеЗаполнено(ВидЛида) Тогда
		ОтборЗапроса.Добавить("Лиды.Вид = &ОтборВид");
		Запрос.УстановитьПараметр("ОтборВид", ВидЛида);
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Запрос.УстановитьПараметр("НовыеНачало", ОтборПериодЗначение.ДатаНачала);
	Запрос.УстановитьПараметр("НовыеКонец", ОтборПериодЗначение.ДатаОкончания);
	Запрос.УстановитьПараметр("Менеджеры", Менеджеры);
	
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	ТабличныйДокумент.Вывести(СтруктураОбластей.Шапка);
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	
	НовыйИтог = 0;

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураОбластей.Строка.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(СтруктураОбластей.Строка);
		
		НовыйИтог = НовыйИтог + Число(Выборка.Новый);
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(СтруктураОбластей.Отступ);
	
	СтруктураОбластей.Итог.Параметры.НовыйИтог = НовыйИтог;
	ТабличныйДокумент.Вывести(СтруктураОбластей.Итог);
	
	Возврат ПоместитьВоВременноеХранилище(ТабличныйДокумент, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура СФормироватьПриОткрытии()
	
	СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура МенеджерыЗавершениеВыбора(РезультатВыбора, ПараметрыОбработчика) Экспорт
	
	Если ТипЗнч(РезультатВыбора) <> Тип("СписокЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	ОтборМенеджерыВсе = РезультатВыбора;
	
	ОтборМенеджеры = Новый СписокЗначений;
	Для Каждого ЭлементСписка Из РезультатВыбора Цикл
		Если ЭлементСписка.Пометка Тогда
			ОтборМенеджеры.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление, ЭлементСписка.Пометка, ЭлементСписка.Картинка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция РезультатЛидаПоОтбору()
	
	Если ОтборРезультат = "ВРаботе" Тогда
		Возврат Перечисления.ВариантЗавершенияРаботыСЛидом.ПустаяСсылка();
	ИначеЕсли ОтборРезультат = "КачественныйЛид" Тогда
		Возврат Перечисления.ВариантЗавершенияРаботыСЛидом.ПереведенВПокупателя;
	ИначеЕсли ОтборРезультат = "НекачественныйЛид" Тогда
		Возврат Перечисления.ВариантЗавершенияРаботыСЛидом.НекачественныйЛид;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ВидЛидаПоОтбору()
	
	Если ОтборВид = "Первичное" Тогда
		Возврат Перечисления.ВидыЛидов.ПервичноеОбращение;
	ИначеЕсли ОтборВид = "Повторное" Тогда
		Возврат Перечисления.ВидыЛидов.ПовторноеОбращение;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСпискиВыбора()
	
	ПредставлениеЗначения = Новый ФорматированнаяСтрока(БиблиотекаКартинок.ПервичныйЛид, НСтр("ru = ' Первичное'"));
	ИнтерактивныйСписокВыбораВидаЛида.Добавить("Первичное", ПредставлениеЗначения);
	ПредставлениеЗначения = Новый ФорматированнаяСтрока(БиблиотекаКартинок.ПовторныйЛид, НСтр("ru = ' Повторное'"));
	ИнтерактивныйСписокВыбораВидаЛида.Добавить("Повторное", ПредставлениеЗначения);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗначениеОтбораПоПериоду()
	
	//@skip-check unknown-form-parameter-access
	Если Параметры.Свойство("Отбор") И ТипЗнч(Параметры.Отбор) = Тип("Структура") Тогда
		Если Параметры.Отбор.Свойство("ПериодРасшифровки") Тогда	
			ОтборПериодРасшифровка = Параметры.Отбор.ПериодРасшифровки; 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АдаптацияТакси()
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.КоманднаяПанель.Видимость = Истина;
	Элементы.Переместить(Элементы.ФормаСформировать, Элементы.КоманднаяПанель);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИзменитьФорму", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Справка", "Видимость", Ложь);
	
КонецПроцедуры

#КонецОбласти
